import dogeCoin from '../../assets/news/dogeCoin.png';
import shareIcon from '../../assets/news/share.png';
import TenCard from '../../components/Card';
function TrainingThird() {
   const news = [
      {
         img: dogeCoin,
         shareIcon: shareIcon,
         infoName: 'Хувьцааdd',
         infoTypeColor: 'RGB(1,174,150, 0.15)',
         infoTextColor: '#00904d',
         date: '2012-20-20',
         title: 'АРИЛЖААНЫ МЭДЭЭ',
         description: `2023 оны 1 дүгээр сарын 25-ны өдөр энгийн арилжаагаар 45 хувьцаат компанийн 479,552,444 төгрөгийн үнийн дүн бүхий 1,369,435 ширхэг хувьцаа арилжаалагдсанаас 23 компанийн хувьцааны ханш өсөж, 17 компанийн хувьцааны ханш буурсан бол 5 компанийн ханш тогтвортой байлаа. Үүнээс "Жидакс" ХК (SOH +15.00%), "Э-Транс ложистикс" XК (ETR +12.49%) болон "Махимпекс" ХК (MMX +7.08%) зэрэг компаниудын хувьцааны ханш хамгийн өндөр өсөлттэй байсан бол "Увс чацаргана" ХК (CHR -13.85%), "Хөвсгөл алтан дуулга" ХК (ADU -7.21%) болон "Мерекс" ХК (MRX -7.14%)-ийн хувьцаа хамгийн их уналттай байлаа.`
      },
      {
         img: dogeCoin,
         shareIcon: shareIcon,
         infoName: 'Хувьцааdd',
         infoTypeColor: 'RGB(1,174,150, 0.15)',
         infoTextColor: '#00904d',
         date: '2012-20-20',
         title: 'Хөрөнгийн зах зээлд ажиллах эрх бүхий аттестатчилалд ажилтнуудаа тухай бүр хамруулж байна.',
         description: `2023 оны 1 дүгээр сарын 25-ны өдөр энгийн арилжаагаар 45 хувьцаат компанийн 479,552,444 төгрөгийн үнийн дүн бүхий 1,369,435 ширхэг хувьцаа арилжаалагдсанаас 23 компанийн хувьцааны ханш өсөж, 17 компанийн хувьцааны ханш буурсан бол 5 компанийн ханш тогтвортой байлаа. Үүнээс "Жидакс" ХК (SOH +15.00%), "Э-Транс ложистикс" XК (ETR +12.49%) болон "Махимпекс" ХК (MMX +7.08%) зэрэг компаниудын хувьцааны ханш хамгийн өндөр өсөлттэй байсан бол "Увс чацаргана" ХК (CHR -13.85%), "Хөвсгөл алтан дуулга" ХК (ADU -7.21%) болон "Мерекс" ХК (MRX -7.14%)-ийн хувьцаа хамгийн их уналттай байлаа.`
      }
   ];
   return (
      <TenCard
         cols={2}
         gap={6}
         BRadius="8px"
         cardHeight="455px"
         imgHeight="195px"
         descriptionHeight="95px"
         items={news}
      />
   );
}
export default TrainingThird;
